# IdeaStatiCa.RcsApi.Model.ReinforcedCrossSectionData

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Name** | **string** |  | [optional]
**CrossSection** | **RcsCrossSectionData** |  | [optional]
**Bars** | **List&lt;RcsReinforcedBarData&gt;** |  | [optional]
**Stirrups** | **List&lt;RcsStirrupsData&gt;** |  | [optional]
**TendonBars** | **List&lt;RcsTendonBarData&gt;** |  | [optional]
**TendonDucts** | **List&lt;RcsTendonDuctData&gt;** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)